1
// Чем отличается Bootstrap 5 от 3 и 4 версии

//с новыми компонентами, более быстрой таблицей стилей и большей отзывчивостью
//Bootstrap 5 поддерживает последние стабильные версии всех основных браузеров и платформ
//Основное различие между Bootstrap 5 и Bootstrap 3 и 4 заключается в том, что Bootstrap 5 переключился на JavaScript вместо jQuery

2
// Что такое Bootstrap? разьясни своими словами

//это бесплатный интерфейсный фреймворк для более быстрой и простой веб-разработки

3
// Что такое адаптивный веб дизайн?

//Отзывчивый веб-дизайн — это создание веб-сайтов, которые автоматически настраиваются, чтобы хорошо выглядеть на всех устройствах,-
//от маленьких телефонов до больших настольных компьютеров

4
// Зачем использовать стоит использовать Bootstrap?

//любой, у кого есть только базовые знания HTML и CSS, может начать использовать Bootstrap.

5
// Какими 2мя методами можно подключить Bootstrap?

//Включить Bootstrap 5 из CDN
//Загрузите Bootstrap 5 с сайта getbootstrap.com

6
// В чем преимущество CDN?

//многие пользователи уже загрузили Bootstrap 5 с jsDelivr при посещении другого сайта.
//В результате он будет загружаться из кеша при посещении вашего сайта 

7
// Для чего в Bootstrap используется JavaScript?

//Bootstrap 5 использует JavaScript для различных компонентов -
//(таких как модальные окна, всплывающие подсказки, всплывающие окна и т. д.). Однако, е-
//сли вы просто используете CSS-часть Bootstrap, они вам не нужны.

8
// На какие 2 вида подразделяются контейнеры в Bootstrap?

//Bootstrap 5 также требует наличия содержащего элемента для переноса содержимого сайта

9
// Сколько пикселей будет фиксированный контейнер если ширина меньше 576px

//100%

10
// Сколько пикселей будет фиксированный контейнер если ширина больше или равно 576px

//540px

11
// Сколько пикселей будет фиксированный контейнер если больше или равно 768px

//720px

12
// Сколько пикселей будет фиксированный контейнер если больше или равно 992px

//960px

13 
// Сколько пикселей будет фиксированный контейнер если больше или равно 1200px

//1140px

14 
// Сколько пикселей будет фиксированный контейнер если больше или равно 1400px

//1320px

15 
// Сколько пикселей занимает Жидкий контейнер?

//Используйте .container-fluid класс для создания контейнера полной ширины, который всегда будет охватывать всю ширину экрана ( width всегда 100%)

16
// Какие размеры есть у фиксированного контейнера перечисли
// Пример: .container-sm
//.container-sm|md|lg|xl 